Revit 2026 API

# NurbSplineCreateCurve(Int32, IListDouble, IListXYZ) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Curve CreateCurve(
	int degree,
	IList<double> knots,
	IList<XYZ> controlPoints
)
```
```vb
Public Shared Function CreateCurve (
	degree As Integer,
	knots As IList(Of Double),
	controlPoints As IList(Of XYZ)
) As Curve
```
```cpp
public:
static Curve^ CreateCurve(
	int degree,
	IList<double>^ knots,
	IList<XYZ^>^ controlPoints
)
```
```fsharp
static member CreateCurve :
        degree : int *
        knots : IList<float> *
        controlPoints : IList<XYZ> -> Curve
```

#### Parameters

degree Int32

knots IListDouble

controlPoints IListXYZ

#### Return Value

Curve

#### Reference

NurbSpline Class

CreateCurve Overload

Autodesk.Revit.DB Namespace